/*
 * Задание
 * Сейчас вам требуется создать 3 переменных с помощью ключевого слова const.
 * Каждая переменная будет подразумевать под собой вопрос. Поэтому назовите их как question1, question2 и question3.

 * Присвойте данным переменным следующие значения:
 * 1. Какая самая маленькая страна мира по населению?
 * 2. Какая самая большая страна мира по населению?
 * 3. Какой самый большой материк на планете?

 * Также создайте еще 3 переменные с помощью const. Они будут отвечать за ответы на
 * вопросы. Названия для них должны быть следующими: answer1, answer2, answer3.

 * Присвойте этим переменным данные ответы:
 * 1. Китай
 * 2. Евразия
 * 3. Ватикан

 * Ответы перемешаны и ваша задача состоит в том, чтобы найти правильные ответы к
 * вопросам. Чтобы это сделать сопоставьте вопрос и ответ и выведите их в консоль по данному шаблону:

 * console.log(question1, 'Ответ:', answer2);

 * Откройте файл const.html в браузере и посмотрите на результат.
 */

const question1 = 'Какая самая маленькая страна мира по населению?';
const question2 = 'Какая самая большая страна мира по населению?';
const question3 = 'Какой самый большой материк на планете?';

const answer1 = 'Китай';
const answer2 = 'Евразия';
const answer3 = 'Ватикан';

console.log(question1, 'ответ: ', answer3);
console.log(question2, 'ответ: ', answer1);
console.log(question2, 'ответ: ', answer2);
