/*
 * Задание 1
 * Необходимо в JS-файле создать комментарий с текстом “JavaScript код с созданием переменных” с помощью способа “//”

 * создать комментарий на 2 строчки с помощью /*.
 * В первой строчке будет текст “Автор:”, а на 2-й - ваше Имя и Фамилия либо никнейм.
 */

// var
// let
// const

/*
Автор: 
squbert
*/

/*
* Задание 2
* Ваша задача состоит в том, чтобы создать следующие переменные:
* 1. myName. Присвойте этой переменной ваше имя.
* 2. mySurname. Присвойте этой переменной вашу фамилию. Если не хотите ее указывать, то просто напишите пустую строку.
* 3. myFavoriteDrink. Укажите ваш любимый напиток.
* 4. myFavoriteAnimal. Укажите ваше любимое домашнее животное.
* 5. myFavoriteProgrammingLanguage. Вы просто обязаны указать JavaScript.
*     Шутка, конечно же присваивайте значение на ваше усмотрение.

* При создании переменных соблюдайте следующие условия:
* 1. Используйте при объявления переменных только let и const. var мы использовать
*     не будем так как он является устаревшим.
* 2. Выберете один из стилей написание кода: с точкой с запятой либо без нее.

* После того, как вы создадите переменные, вам требуется вывести их все в консоль с
* помощью console.log. Для каждой переменной должен быть свой console.log.
* Запустите HTML-файл в браузере, откройте консоль и посмотрите на результат.
 */

const meName = 'Валерий';
const mySurname = 'Васильев';
let myFavoriteDrink = 'Coffee';
let myFavoriteAnimal = 'Лемур';
const myFavoriteProgrammingLanguage = 'JS';

console.log(meName);
console.log(mySurname);
console.log(myFavoriteDrink);
console.log(myFavoriteAnimal);
console.log(myFavoriteProgrammingLanguage);
